HomeWork103forEDT/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

HomeWork103forEDT/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

HomeWork103forEDT/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтоФизЛицо = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо")); 
	
	Если ЭтоФизЛицо Тогда
		
		Если ЭтоФизЛицо Тогда			
			Элементы.КПП.Доступность = Ложь; 		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	ЭтоФизЛицо = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо")); 
	
	Если ЭтоФизЛицо Тогда		
		Элементы.КПП.Доступность = Ложь;
	Иначе
		Элементы.КПП.Доступность = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РасшифровкаНаименованияКонтрагента(Наименование)  //Функция расшифровки выполняется там, откуда вызвана. ПриИзменении - на клиенте ПриЧтении - на сервере
	
	СловаНаименования = СтрРазделить(Наименование, " .,""-:", Ложь);
	Для Каждого Слово Из СловаНаименования Цикл 
		
		ИндексСлова = СловаНаименования.Найти(Слово);
		Слово = Врег(Слово); 
		
		Если Слово = "ЗАО" Тогда
			Слово = "Закрытое акционерное общество";
			СловаНаименования.Удалить(ИндексСлова);
			СловаНаименования.Вставить(0, Слово);
			Расшифровка = СтрСоединить(СловаНаименования," ");
		ИначеЕсли Слово = "ООО" Тогда
			Слово = "Общество с ограниченной ответственностью";
			СловаНаименования.Удалить(ИндексСлова);
			СловаНаименования.Вставить(0, Слово);
			Расшифровка = СтрСоединить(СловаНаименования," ");
		ИначеЕсли Слово = "ИП" Тогда
			Слово = "Индивидуальный предприниматель";
			СловаНаименования.Удалить(ИндексСлова);
			СловаНаименования.Вставить(0, Слово);
			Расшифровка = СтрСоединить(СловаНаименования," ");
		ИначеЕсли 
			Слово = "ОАО" Тогда
			Слово = "Открытое акционерное общество";
			СловаНаименования.Удалить(ИндексСлова);
			СловаНаименования.Вставить(0, Слово);
			Расшифровка = СтрСоединить(СловаНаименования," ");
		ИначеЕсли 
			Слово = "ПКФ" Тогда
			Слово = "Производственно-коммерческая фирма";
			СловаНаименования.Удалить(ИндексСлова);
			СловаНаименования.Вставить(0, Слово);
			Расшифровка = СтрСоединить(СловаНаименования," ");			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Расшифровка;
	
КонецФункции 

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент) //При вводе или изменении значения в поле Наименование и если поле полное наименование пустое и не редактировалось пользователем, то указывает полное наименование
	
	Если НЕ ЗапретНаРасшифровкуНаименования Тогда
		ТекстРасшифровки = РасшифровкаНаименованияКонтрагента(Объект.Наименование);
		Объект.ПолноеНаименование = ТекстРасшифровки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) //При открытии заполненной ранее формы объекта, если поле полное наименование пустое и не редактировалось пользователем, то указывает полное наименование
	
	ЗапретНаРасшифровкуНаименования = ЗначениеЗаполнено(Объект.ПолноеНаименование) И
	РасшифровкаНаименованияКонтрагента(Объект.Наименование) <> Объект.ПолноеНаименование;  // Условие запрета на изменнение полного наименования если оно изменено вручную.
	
	Если НЕ ЗапретНаРасшифровкуНаименования Тогда
		ТекстРасшифровки = РасшифровкаНаименованияКонтрагента(Объект.Наименование);
		Объект.ПолноеНаименование = ТекстРасшифровки;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстОшибки = "";
	Если НЕ РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип, ТекстОшибки) Тогда
		
		Отказ = Истина;
		Сообщить(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ТекстОшибки = "";
	Если РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип, ТекстОшибки) Тогда
		
	Элементы.ИНН.ЦветТекста = Новый Цвет;	
	Элементы.ОшибкаИНН.Видимость = Ложь;
	Элементы.ОшибкаИНН.Заголовок = "";
	
Иначе
	
	Элементы.ИНН.ЦветТекста = WebЦвета.Кирпичный;	
	Элементы.ОшибкаИНН.Видимость = Истина;
	Элементы.ОшибкаИНН.Заголовок = ТекстОшибки;

	КонецЕсли;
	
КонецПроцедуры
